Repository: FlowSc/blockmerge
Catalog: lib/l10n/app_*.arb
Languages: es, ja

source: START
es: JUGAR
ja: スタート

source: LEADERBOARD
es: CLASIFICACIÓN
ja: ランキング

source: Settings
es: Ajustes
ja: 設定

# bgm
source: Background Music
es: Música de fondo
ja: BGM

# bgmDesc
source: Game background music
es: Música de fondo del juego
ja: ゲームBGM

# sfx
source: Sound Effects
es: Efectos de sonido
ja: 効果音

# sfxDesc
source: Merge and drop sound effects
es: Efectos de sonido de fusión y caída
ja: マージ・ドロップ効果音

source: Vibration
es: Vibración
ja: 振動

# vibrationDesc
source: Haptic feedback on merge and drop
es: Vibración al fusionar y soltar bloques
ja: マージ・ドロップ時の触覚フィードバック

source: Ghost Block
es: Bloque fantasma
ja: ゴーストブロック

# ghostBlockDesc
source: Preview block landing position
es: Vista previa de la posición de aterrizaje
ja: ブロックの着地位置をプレビュー

source: Nickname
es: Apodo
ja: ニックネーム

# nicknameNotSet
source: Not set
es: Sin definir
ja: 未設定

source: Review Tutorial
es: Repetir tutorial
ja: チュートリアルを見直す

source: Restore Purchases
es: Restaurar compras
ja: 購入を復元

source: Restoring purchases...
es: Restaurando compras...
ja: 購入を復元中...

source: Set Nickname
es: Establecer apodo
ja: ニックネーム設定

# nicknameHint
source: A-Z, 0-9, _ only (2-10 chars)
es: Solo A-Z, 0-9, _ (2-10 caracteres)
ja: A-Z, 0-9, _ のみ（2〜10文字）

# nicknameMinError
source: Enter at least 2 characters
es: Introduce al menos 2 caracteres
ja: 2文字以上入力してください

# nicknameMaxError
source: Maximum 10 characters
es: Máximo 10 caracteres
ja: 最大10文字までです

source: Cancel
es: Cancelar
ja: キャンセル

source: Save
es: Guardar
ja: 保存

source: Remove Ads
es: Eliminar anuncios
ja: 広告を削除

source: Purchased
es: Comprado
ja: 購入済み

# removeAdsDesc
source: Permanently remove all ads
es: Eliminar todos los anuncios permanentemente
ja: すべての広告を永久に削除します

# removeAdsConfirm
source: Remove all ads permanently for {price}?
es: ¿Eliminar todos los anuncios permanentemente por {price}?
ja: {price}ですべての広告を永久に削除しますか？

# removeAdsConfirmDefault
source: Remove all ads permanently?
es: ¿Eliminar todos los anuncios permanentemente?
ja: すべての広告を永久に削除しますか？

source: Purchase
es: Comprar
ja: 購入

source: GAME OVER
es: FIN DEL JUEGO

# scoreLabel
source: SCORE
es: PUNTOS

# levelLabel
source: LV.{level}
es: NV.{level}

# scoreValue
source: Score: {score}
es: Puntos: {score}
ja: スコア: {score}

source: Merges
es: Fusiones
ja: マージ数

source: Max Chain
es: Cadena máx.
ja: 最大チェイン

# scoreSubmitFailed
source: Failed to submit score
es: Error al enviar la puntuación
ja: スコアの送信に失敗しました

source: Score submitted!
es: ¡Puntuación enviada!
ja: スコアを送信しました！

source: Submit Score
es: Enviar puntuación
ja: スコアを送信

source: HOME
es: INICIO

source: RANK
es: RANGO

source: RETRY
es: REINTENTAR

source: PAUSED
es: PAUSADO

# resume
source: Continue
es: Continuar
ja: 続ける

source: Quit
es: Salir
ja: やめる

source: YOU WIN!
es: ¡GANASTE!

source: NEXT
es: SIGUIENTE

source: NEW BEST!
es: ¡NUEVO RÉCORD!

source: MERGE!
es: ¡FUSIÓN!

source: CHAIN x2!
es: ¡CADENA x2!

source: CHAIN x3!
es: ¡CADENA x3!

# amazingChain
source: AMAZING x{count}!
es: ¡INCREÍBLE x{count}!

# spectacularChain
source: SPECTACULAR x{count}!
es: ¡ESPECTACULAR x{count}!

# legendaryChain
source: LEGENDARY x{count}!
es: ¡LEGENDARIO x{count}!

source: Skip
es: Omitir
ja: スキップ

# tutorialIntroTitle
source: Drop blocks and merge same numbers!
es: ¡Suelta bloques y fusiona números iguales!
ja: ブロックを落として 同じ数字を合体させよう！

# tutorialIntroDesc
source: Place falling blocks. Same-number tiles merge automatically.
es: Coloca los bloques que caen. Los números iguales se fusionan automáticamente.
ja: 落ちてくるブロックを配置しよう。同じ数字のタイルが隣り合うと自動でマージされます。

# tutorialControls
source: Controls
es: Controles
ja: 操作方法

source: Swipe Left/Right
es: Deslizar izquierda/derecha
ja: 左右スワイプ

source: Move Block
es: Mover bloque
ja: ブロック移動

source: Tap
es: Tocar
ja: タップ

source: Rotate Block
es: Rotar bloque
ja: ブロック回転

# swipeDownFast
source: Fast Swipe Down
es: Deslizar rápido hacia abajo
ja: 素早く下スワイプ

source: Hard Drop
es: Caída instantánea
ja: 即落下

source: Swipe Down
es: Deslizar hacia abajo
ja: 下スワイプ

source: Soft Drop
es: Caída suave
ja: 高速落下

# tutorialChainTitle
source: Chain Merge
es: Fusión en cadena
ja: チェインマージ

# tutorialChainDesc
source: Chain merges give explosive score bonuses!
es: ¡Las fusiones en cadena dan bonificaciones explosivas!
ja: 連鎖マージでスコアが爆発的にアップ！

# tutorialChainExample
source: CHAIN x3 x7 x15 !
es: CADENA x3 x7 x15 !

# tutorialGoTitle
source: Go for the highest score!
es: ¡Consigue la puntuación más alta!
ja: 最高スコアを 目指そう！

# tutorialGoDesc
source: Game over when blocks reach the top. Place strategically and aim for chains!
es: El juego termina cuando los bloques llegan arriba. ¡Coloca estratégicamente y busca cadenas!
ja: ブロックが頂上に達するとゲームオーバー。 戦略的に配置してチェインを狙おう！

# loadFailed
source: Failed to load
es: Error al cargar
ja: 読み込みに失敗しました

source: Try Again
es: Reintentar
ja: 再試行

# noRecords
source: No records yet
es: Aún no hay registros
ja: まだ記録がありません

# leaderboardEntry
source: Merges: {merges} | Chain: x{chain}
es: Fusiones: {merges} | Cadena: x{chain}
ja: マージ: {merges} | チェイン: x{chain}

source: Enter Nickname
es: Introducir apodo
ja: ニックネームを入力

# nicknameDialogHint
source: A-Z, 0-9, _ only (2-10 chars)
es: Solo A-Z, 0-9, _ (2-10 caracteres)
ja: A-Z, 0-9, _ のみ（2〜10文字）

# watchAdContinue
source: WATCH AD
es: VER ANUNCIO
ja: 広告を見る

# continueGame
source: CONTINUE
es: CONTINUAR
ja: コンティニュー

source: KEEP GOING
es: SEGUIR JUGANDO
ja: 続ける

# quitConfirmTitle
source: Quit Game?
es: ¿Salir del juego?
ja: ゲームをやめますか？

# quitConfirmMessage
source: Your current progress will be lost.
es: Se perderá tu progreso actual.
ja: 現在の進行状況は失われます。

source: TIME ATTACK
es: CONTRARRELOJ
ja: タイムアタック

# timeUp
source: TIME'S UP!
es: ¡TIEMPO AGOTADO!
ja: タイムアップ！

source: CLASSIC
es: CLÁSICO
ja: クラシック

source: MY BEST
es: MI MEJOR
ja: 自己ベスト

# noRecord
source: No record yet
es: Sin registro aún
ja: 記録なし

# periodDaily
source: TODAY
es: HOY
ja: 今日

# periodWeekly
source: WEEK
es: SEMANA
ja: 週間

# periodMonthly
source: MONTH
es: MES
ja: 月間

# periodYearly
source: YEAR
es: AÑO
ja: 年間

# periodAll
source: ALL
es: TODO
ja: 全期間

# pauseNotAllowed
source: Pause is not available in Time Attack!
es: ¡La pausa no está disponible en Contrarreloj!
ja: タイムアタックでは 一時停止できません！

# timeAttackTutorialTitle
source: TIME ATTACK
es: CONTRARRELOJ
ja: タイムアタック

# timeAttackTutorialRule1
source: 3 minutes to score as high as you can!
es: ¡3 minutos para conseguir la mayor puntuación posible!
ja: 3分間で最高スコアを 目指しましょう！

# timeAttackTutorialRule2
source: Pause is disabled. Stay focused!
es: La pausa está desactivada. ¡Concéntrate!
ja: 一時停止はできません。 集中しましょう！

# timeAttackTutorialRule3
source: Timer keeps running even in background.
es: El temporizador sigue corriendo incluso en segundo plano.
ja: バックグラウンドでも タイマーは止まりません。

# timeAttackTutorialGo
source: GO!
es: ¡YA!

source: Privacy Policy
es: Política de privacidad
ja: プライバシーポリシー
